export const planets = {
	mercury: {
		name: "Меркурий",
		image: "./img/planets/Mercury.png",
		diameter: {
			km: 4879,
			smartphones: 60988,
			comparison: "Диаметр Меркурия равен 60 988 уложенным смартфонам",
		},
		temperature: {
			celsius: {
				day: 430,
				night: -180,
				average: 167,
			},
			household: {
				item: "🔥",
				description:
					"Средняя оверхность Меркурия достигает 167 °C — горячее, чем цикл самоочистки духовки",
			},
		},
		mass: {
			kg: 3.3e23,
			earthMass: 0.055,
			elephants: 55000000000,
			comparison: "Масса Меркурия равна массе 55 миллиардов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 57.9e6,
				au: 0.39,
			},
			period: {
				days: 88,
			},
			airplaneTrips: 1448,
			comparison:
				"Орбита Меркурия равна 1448 кругосветным перелётам на самолёте",
		},
	},

	venus: {
		name: "Венера",
		image: "./img/planets/Venus.png",
		diameter: {
			km: 12104,
			smartphones: 151300,
			comparison: "Диаметр Венеры равен 151 300 уложенным смартфонам",
		},
		temperature: {
			celsius: {
				day: 465,
				night: 465,
				average: 465,
			},
			household: {
				item: "🔥🔥",
				description:
					"Температура на Венере достигает 465 °C — этого достаточно, чтобы расплавить свинец и цинк",
			},
		},
		mass: {
			kg: 4.87e24,
			earthMass: 0.815,
			elephants: 812000000000,
			comparison: "Масса Венеры равна массе 812 миллиардов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 108.2e6,
				au: 0.72,
			},
			period: {
				days: 225,
			},
			airplaneTrips: 2705,
			comparison: "Орбита Венеры равна 2705 кругосветным перелётам на самолёте",
		},
	},

	earth: {
		name: "Земля",
		image: "./img/planets/Earth.png",
		diameter: {
			km: 12742,
			smartphones: 159275,
			comparison: "Диаметр Земли равен 159 275 уложенным смартфонам",
		},
		temperature: {
			celsius: {
				day: 15,
				night: 0,
				average: 15,
			},
			household: {
				item: "☕️",
				description: "Средняя температура Земли — 15 °C, как у остывшего кофе",
			},
		},
		mass: {
			kg: 5.97e24,
			earthMass: 1,
			elephants: 995000000000,
			comparison: "Масса Земли равна массе 995 миллиардов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 149.6e6,
				au: 1,
			},
			period: {
				days: 365.25,
			},
			airplaneTrips: 3740,
			comparison: "Орбита Земли равна 3740 кругосветным перелётам на самолёте",
		},
	},

	mars: {
		name: "Марс",
		image: "./img/planets/Mars.png",
		diameter: {
			km: 6779,
			smartphones: 84738,
			comparison: "Диаметр Марса равен 84 738 уложенным смартфонам",
		},
		temperature: {
			celsius: {
				day: 20,
				night: -73,
				average: -63,
			},
			household: {
				item: "❄️",
				description:
					"Средняя температура на Марсе — -63 °C, холоднее, чем в морозильнике",
			},
		},
		mass: {
			kg: 6.42e23,
			earthMass: 0.107,
			elephants: 107000000000,
			comparison: "Масса Марса равна массе 107 миллиардов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 227.9e6,
				au: 1.52,
			},
			period: {
				days: 687,
			},
			airplaneTrips: 5698,
			comparison: "Орбита Марса равна 5698 кругосветным перелётам на самолёте",
		},
	},

	jupiter: {
		name: "Юпитер",
		image: "./img/planets/Jupiter.png",
		diameter: {
			km: 139820,
			smartphones: 1747750,
			comparison:
				"Диаметр Юпитера равен более 1,7 миллионам уложенных смартфонов",
		},
		temperature: {
			celsius: {
				day: -145,
				night: -145,
				average: -145,
			},
			household: {
				item: "❄️❄️",
				description:
					"Верхние облака Юпитера — -145 °C, холоднее самого холодного места на Земле",
			},
		},
		mass: {
			kg: 1.9e27,
			earthMass: 318,
			elephants: 316410000000000,
			comparison: "Масса Юпитера равна массе 316 триллионов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 778.3e6,
				au: 5.2,
			},
			period: {
				days: 4333,
			},
			airplaneTrips: 19458,
			comparison:
				"Орбита Юпитера равна 19458 кругосветным перелётам на самолёте",
		},
	},

	saturn: {
		name: "Сатурн",
		image: "./img/planets/Saturn.png",
		diameter: {
			km: 116460,
			smartphones: 1455750,
			comparison:
				"Диаметр Сатурна равен более 1,4 миллионам уложенных смартфонов",
		},
		temperature: {
			celsius: {
				day: -178,
				night: -178,
				average: -178,
			},
			household: {
				item: "❄️❄️❄️",
				description:
					"Температура на Сатурне — -178 °C, достаточно низкая, чтобы заморозить кислород",
			},
		},
		mass: {
			kg: 5.68e26,
			earthMass: 95,
			elephants: 94525000000000,
			comparison: "Масса Сатурна равна массе 94,5 триллионов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 1427e6,
				au: 9.54,
			},
			period: {
				days: 10759,
			},
			airplaneTrips: 35675,
			comparison:
				"Орбита Сатурна равна 35675 кругосветным перелётам на самолёте",
		},
	},

	uranus: {
		name: "Уран",
		image: "./img/planets/Uranus.png",
		diameter: {
			km: 50724,
			smartphones: 634050,
			comparison: "Диаметр Урана равен 634 050 уложенным смартфонам",
		},
		temperature: {
			celsius: {
				day: -195,
				night: -195,
				average: 195,
			},
			household: {
				item: "☠️❄️",
				description:
					"Температура Урана — -195 °C, почти как в условиях криосохранения",
			},
		},
		mass: {
			kg: 8.68e25,
			earthMass: 14.5,
			elephants: 14427500000000,
			comparison: "Масса Урана равна массе 14,4 триллионов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 2871e6,
				au: 19.18,
			},
			period: {
				days: 30687,
			},
			airplaneTrips: 71775,
			comparison: "Орбита Урана равна 71775 кругосветным перелётам на самолёте",
		},
	},

	neptune: {
		name: "Нептун",
		image: "./img/planets/Neptune.png",
		diameter: {
			km: 49244,
			smartphones: 615550,
			comparison: "Диаметр Нептуна равен 615 550 уложенным смартфонам",
		},
		temperature: {
			celsius: {
				day: -200,
				night: -200,
				average: -200,
			},
			household: {
				item: "☠️❄️",
				description: "Температура Нептуна — -200 °C, почти как у жидкого азота",
			},
		},
		mass: {
			kg: 1.02e26,
			earthMass: 17.1,
			elephants: 17014500000000,
			comparison: "Масса Нептуна равна массе 17 триллионов слонов",
		},
		orbit: {
			distanceFromSun: {
				km: 4497e6,
				au: 30.07,
			},
			period: {
				days: 60190,
			},
			airplaneTrips: 112425,
			comparison:
				"Орбита Нептуна равна 112425 кругосветным перелётам на самолёте",
		},
	},
};
